# IPZ-11 ПІБ individual work
print('''ІПЗ-11 ПІБ індивідуальна робота на тему "Прогнозування результатів \
модульного та сесійного контролю знань студентів з дисципліни «Основи програмування»"\
\nДана програма здійснює прогноз екзаменаційної оцінки на основі поточних \
результатів успішності з дисципліни «Основи програмування» та споріднених \
з нею (Вища математика, Дискретна математика, Архітектура комп'ютера), \
використовуючи методи кластерного аналізу, машинного навчання, експертних оцінок. \
\nПеред написанням даної програми прочитано рекомендовану літературу, а також \
додаткову літературу з інтернету.\
\nЗВЕРНІТЬ УВАГУ: для універсальності даної програми всі оцінки потрібно вводити і будуть виводитись в 100-бальній системі!!!''')
#========================= Метод кластерного аналізу ==============================================================================
#В якості кластерів будемо приймати дисципліни, причому дисципліни також можна 
#умовно поділити на кластери(наприклад, кластер, що стосується оцінок, і кластер,
#що стосується кількості пропусків)
#====================================================== «Основи програмування» =====================================================

#=========================================================== Дискретна математика =================================================

#=========================== Основи математики (Вища математика) ===============================================================

#=========================== Архітектура комп'ютера ===============================================================

#===================================== Основна програма ==================================================================
print('Вкажіть, який випадок розглядається: \
\n1.Загальний \
\n2.Конкретизований для студентів КНУ ФІТ ІПЗ')

print('Вкажіть складність прогнозування: \
\n1.Скорочена (з урахуванням результатів лише з дисципліни Основи програмування) \
\n2.Ускладнена (з урахуванням максимальної кількості корисних для прогнозування дисциплін)')

print('Вкажіть модульний чи сесійний контроль потрібно спрогнозувати(оберіть номер): \
\n 1.Сесійний контроль \
\n 2.Модульний контроль')


