var template = 
{
    student_name: "Малява Андрій Дмитрович",
    my_variant: "15",
    
    purpose_1: "Запрограмувати операції введення з клавіатури та виведення на екран значень змінних різних типів згідно з форматами даних (форматне введення-виведення) і без використання форматів. Визначити розбіжності у використанні функцій введення - виведення.",
    purpose_2: "Навчитися застосовувати стандартні математичні функції.",
    task_2: "<b>За даними,</b>  що  введені з клавіатури в оперативну пам’ять, визначити значення  виразу,<br> використовуючи математичні функції, і вивести результат на екран.",
    task_3: "Тіло починає рухатися без початкової швидкості з прискоренням a.<br>Обчислити відстань, яку тіло пройде за час t від початку руху.",
    
    analys_2: "Аналіз функції(алгебраїчної). <br> Знаходження аналогу функцій(алгебраїчної) до функцій(програмної).",
    analys_3: "Аналіз задачі.",
    zadacha_3: "Тіло починає рухатися без початкової швидкості з прискоренням a. Обчислити відстань, яку тіло пройде за час t від початку руху.",
    
    conclusion_1: `<big><br>Виконано завдання 1-ої лабораторної роботи, окрім цього, доскально прокоментовано код. <br>
	Отримано досвід роботи з змінними, базовими математичними функціями та фунцкіями в C++ .<br>
	В результаті виконання лаборатної роботи було опановано функції вводу/виводу значень, бібліотеку математичних функцій <b>math.h</b>, <br>
	принципи форматованого виводу тексту.</big>`,
    conclusion_2: `Дороблено шаблон, додані функції та css/js код для фунцкіонала спойлерів!`,
}
